In [1]:
#import des librairies et modules
import pandas as pd
from math import acos, cos, sin, radians

print("setup complete")

setup complete

## 1- Lecture des fichiers

In [2]:
ticket_data_filepath = 'https://raw.githubusercontent.com/AliceShanmugam/Test_tictactrip/main/ticket_data.csv'
ticket_data = pd.read_csv(ticket_data_filepath)

cities_filepath = 'https://raw.githubusercontent.com/AliceShanmugam/Test_tictactrip/main/cities.csv'
cities_data = pd.read_csv(cities_filepath)

providers_filepath = 'https://raw.githubusercontent.com/AliceShanmugam/Test_tictactrip/main/providers.csv'
providers_data = pd.read_csv(providers_filepath)

stations_filepath = 'https://raw.githubusercontent.com/AliceShanmugam/Test_tictactrip/main/stations.csv'
stations_data = pd.read_csv(stations_filepath)

In [3]:
#affiche les tarifs en euro pour plus de lisibilité
def price_in_euro(row):
    row.price_in_cents = 0.01*row.price_in_cents
    return row

ticket_euro_data = ticket_data.apply(price_in_euro, axis='columns')

ticket_euro_data = ticket_euro_data.rename(columns = {'price_in_cents':'price_in_euro'})

In [4]:
ticket_euro_data.head()

,id,company,o_station,d_station,departure_ts,arrival_ts,price_in_euro,search_ts,middle_stations,other_companies,o_city,d_city
0,6795025,8385,NaN,NaN,2017-10-13 14:00:00+00,2017-10-13 20:10:00+00,45.5,2017-10-01 00:13:31.327+00,NaN,NaN,611,542
1,6795026,9,63.0,1044.0,2017-10-13 13:05:00+00,2017-10-14 06:55:00+00,14.5,2017-10-01 00:13:35.773+00,"{149,418}",{13},611,542
2,6795027,8377,5905.0,6495.0,2017-10-13 13:27:00+00,2017-10-14 21:24:00+00,74.0,2017-10-01 00:13:40.212+00,"{798,798,6794,6246}","{8377,8376}",611,542
3,6795028,8377,5905.0,6495.0,2017-10-13 13:27:00+00,2017-10-14 11:02:00+00,135.0,2017-10-01 00:13:40.213+00,"{798,798,6794,6246}","{8377,8376}",611,542
4,6795029,8381,5905.0,6495.0,2017-10-13 21:46:00+00,2017-10-14 19:32:00+00,77.1,2017-10-01 00:13:40.213+00,"{5983,5983}",{8380},611,542

In [5]:
cities_data.head()

,id,local_name,unique_name,latitude,longitude,population
0,5159,"Padua, Veneto, Italia",padua,45.406435,11.876761,209678.0
1,76,"Barcelona, Cataluña, España",barcelona,41.385064,2.173404,1611822.0
2,81,"Basel, Basel-Stadt, Schweiz",basel,47.593437,7.619812,NaN
3,259,"Erlangen, Bayern, Deutschland",erlangen,49.589674,11.011961,105412.0
4,11979,"Balș, Olt, România",balș,44.353354,24.095672,NaN

In [6]:
providers_data.head()

,id,company_id,provider_id,name,fullname,has_wifi,has_plug,has_adjustable_seats,has_bicycle,transport_type
0,9,1,NaN,ouibus,Ouibus,True,True,True,False,bus
1,10,2,NaN,deinbus,Deinbus.de,False,False,False,False,bus
2,11,3,NaN,infobus,Infobus,False,False,False,False,bus
3,12,4,NaN,studentAgency,Student Agency,False,False,False,False,bus
4,13,5,NaN,flixbus,Flixbus,True,False,False,False,bus

In [7]:
stations_data.tail()

,id,unique_name,latitude,longitude
11030,11032,Porto Avda De Los Aliados,41.146922,-8.611122
11031,11033,Rom Ciampino Flughafen Piazzale Leonardo da Vinci,41.804102,12.597110
11032,11034,Sants,41.379892,2.139462
11033,11035,Vozilici D66,45.157136,14.164140
11034,11036,Wien Hotel ibis Vienna Airport,48.123229,16.437528

## 2- Exploration des données

### a) Infos utiles

In [8]:
ticket_euro_data.describe()

,id,company,o_station,d_station,price_in_euro,o_city,d_city
count,7.416800e+04,74168.000000,32727.000000,32727.000000,74168.000000,74168.000000,74168.000000
mean,6.832108e+06,7109.565527,2907.132673,2347.858129,43.827111,849.186105,883.776265
std,2.141060e+04,3005.380792,3347.629180,3090.798007,37.393254,1485.791782,1654.698575
min,6.795025e+06,9.000000,3.000000,3.000000,3.000000,5.000000,1.000000
25%,6.813567e+06,8376.000000,400.000000,396.000000,19.000000,485.000000,453.000000
50%,6.832108e+06,8385.000000,701.000000,575.000000,33.500000,628.000000,562.000000
75%,6.850650e+06,8385.000000,6246.000000,4538.000000,52.500000,628.000000,628.000000
max,6.869192e+06,8387.000000,11017.000000,11017.000000,385.500000,12190.000000,12190.000000

In [9]:
print(max(ticket_euro_data['price_in_euro']))   #prix max
print(min(ticket_euro_data['price_in_euro']))   #prix min
print(ticket_euro_data['price_in_euro'].mean()) #prix en moyenne

385.5
3.0
43.82711061373479

In [10]:
ticket_euro_data.dtypes #affiche le type de données des colonnes

id                   int64
company              int64
o_station          float64
d_station          float64
departure_ts        object
arrival_ts          object
price_in_euro      float64
search_ts           object
middle_stations     object
other_companies     object
o_city               int64
d_city               int64
dtype: object

### b) Ajout de la colonne "travel_time"

In [11]:
#conversion des données des colonnes departure_ts et arrival_ts de type object en données de type datetime
ticket_euro_data['departure_ts'] = pd.to_datetime(ticket_euro_data['departure_ts'])
ticket_euro_data['arrival_ts'] = pd.to_datetime(ticket_euro_data['arrival_ts'])

In [12]:
ticket_euro_data.dtypes

id                               int64
company                          int64
o_station                      float64
d_station                      float64
departure_ts       datetime64[ns, UTC]
arrival_ts         datetime64[ns, UTC]
price_in_euro                  float64
search_ts                       object
middle_stations                 object
other_companies                 object
o_city                           int64
d_city                           int64
dtype: object

In [13]:
#création d'une colonne représentant la durée de trajet : "travel_time"
ticket_euro_data['travel_time'] = ticket_euro_data['arrival_ts'] - ticket_euro_data['departure_ts']

In [14]:
ticket_euro_data.head()

,id,company,o_station,d_station,departure_ts,arrival_ts,price_in_euro,search_ts,middle_stations,other_companies,o_city,d_city,travel_time
0,6795025,8385,NaN,NaN,2017-10-13 14:00:00+00:00,2017-10-13 20:10:00+00:00,45.5,2017-10-01 00:13:31.327+00,NaN,NaN,611,542,0 days 06:10:00
1,6795026,9,63.0,1044.0,2017-10-13 13:05:00+00:00,2017-10-14 06:55:00+00:00,14.5,2017-10-01 00:13:35.773+00,"{149,418}",{13},611,542,0 days 17:50:00
2,6795027,8377,5905.0,6495.0,2017-10-13 13:27:00+00:00,2017-10-14 21:24:00+00:00,74.0,2017-10-01 00:13:40.212+00,"{798,798,6794,6246}","{8377,8376}",611,542,1 days 07:57:00
3,6795028,8377,5905.0,6495.0,2017-10-13 13:27:00+00:00,2017-10-14 11:02:00+00:00,135.0,2017-10-01 00:13:40.213+00,"{798,798,6794,6246}","{8377,8376}",611,542,0 days 21:35:00
4,6795029,8381,5905.0,6495.0,2017-10-13 21:46:00+00:00,2017-10-14 19:32:00+00:00,77.1,2017-10-01 00:13:40.213+00,"{5983,5983}",{8380},611,542,0 days 21:46:00

In [15]:
print(max(ticket_euro_data['travel_time']))   #durée max d'un trajet
print(min(ticket_euro_data['travel_time']))   #durée min d'un trajet
print(ticket_euro_data['travel_time'].mean()) #durée moyenne d'un trajet

20 days 12:51:00
0 days 00:20:00
0 days 07:04:37.247600

In [16]:
#identification de la ligne qui comporte la durée max d'un trajet
ticket_euro_data.loc[ticket_euro_data.travel_time == '20 days 12:51:00' ]

,id,company,o_station,d_station,departure_ts,arrival_ts,price_in_euro,search_ts,middle_stations,other_companies,o_city,d_city,travel_time
5175,6800200,8372,860.0,396.0,2017-10-27 23:59:00+00:00,2017-11-17 12:50:00+00:00,32.0,2017-10-02 20:39:10.75+00,"{10760,10144}",{9},126,453,20 days 12:51:00

### c) Ajout de la colonne "travel_distance"

In [17]:
#modification des noms des colonnes pour une lecture simplifiée, une fois les joins effectués
o_stations_data = stations_data.rename(columns = {'id':'o_station','latitude' : 'o_stat_latitude','longitude':'o_stat_longitude','unique_name':'o_stat_unique_name'})
d_stations_data = stations_data.rename(columns = {'id':'d_station','latitude' : 'd_stat_latitude','longitude':'d_stat_longitude','unique_name':'d_stat_unique_name'})
o_stations_data.head()

,o_station,o_stat_unique_name,o_stat_latitude,o_stat_longitude
0,1,Aalen (Stuttgarter Straße),48.835296,10.092956
1,2,Aéroport Bordeaux-Mérignac,44.830226,-0.700883
2,3,Aéroport CDG,49.009900,2.559310
3,4,Aéroport de Berlin-Schönefeld,52.389446,13.520345
4,5,Aéroport de Dresden,51.123604,13.764737

In [18]:
#on effectue des joins des dataframes o_stations_data et d_stations_data sur la dataframe ticket_euro_data 
ticket_euro_data = ticket_euro_data.join(o_stations_data.set_index('o_station'), on='o_station')

In [19]:
ticket_euro_data = ticket_euro_data.join(d_stations_data.set_index('d_station'), on='d_station')

In [20]:
ticket_euro_data.head()

,id,company,o_station,d_station,departure_ts,arrival_ts,price_in_euro,search_ts,middle_stations,other_companies,o_city,d_city,travel_time,o_stat_unique_name,o_stat_latitude,o_stat_longitude,d_stat_unique_name,d_stat_latitude,d_stat_longitude
0,6795025,8385,NaN,NaN,2017-10-13 14:00:00+00:00,2017-10-13 20:10:00+00:00,45.5,2017-10-01 00:13:31.327+00,NaN,NaN,611,542,0 days 06:10:00,NaN,NaN,NaN,NaN,NaN,NaN
1,6795026,9,63.0,1044.0,2017-10-13 13:05:00+00:00,2017-10-14 06:55:00+00:00,14.5,2017-10-01 00:13:35.773+00,"{149,418}",{13},611,542,0 days 17:50:00,Avenue Georges Pompidou,47.896911,1.854277,Station Les Sabines,43.583932,3.860233
2,6795027,8377,5905.0,6495.0,2017-10-13 13:27:00+00:00,2017-10-14 21:24:00+00:00,74.0,2017-10-01 00:13:40.212+00,"{798,798,6794,6246}","{8377,8376}",611,542,1 days 07:57:00,Les Aubrais,47.926740,1.906740,Montpellier,43.604900,3.880500
3,6795028,8377,5905.0,6495.0,2017-10-13 13:27:00+00:00,2017-10-14 11:02:00+00:00,135.0,2017-10-01 00:13:40.213+00,"{798,798,6794,6246}","{8377,8376}",611,542,0 days 21:35:00,Les Aubrais,47.926740,1.906740,Montpellier,43.604900,3.880500
4,6795029,8381,5905.0,6495.0,2017-10-13 21:46:00+00:00,2017-10-14 19:32:00+00:00,77.1,2017-10-01 00:13:40.213+00,"{5983,5983}",{8380},611,542,0 days 21:46:00,Les Aubrais,47.926740,1.906740,Montpellier,43.604900,3.880500

In [21]:
#Il nous manque des données des stations pour calculer la distance de trajet,
#on va donc remplacer les coordonnées des stations par les coordonnées des villes,
#pour avoir une distance de trajet approximative mais proche de la réalité

#modification des noms des colonnes pour une lecture simplifiée, une fois les joins effectués
o_cities_data = cities_data.rename(columns = {'id':'o_city','latitude' : 'o_city_latitude','longitude':'o_city_longitude','unique_name':'o_city_unique_name','local_name':'o_city_local_name','population':'o_city_population'})
d_cities_data = cities_data.rename(columns = {'id':'d_city','latitude' : 'd_city_latitude','longitude':'d_city_longitude','unique_name':'d_city_unique_name','local_name':'d_city_local_name','population':'d_city_population'})

In [22]:
#on effectue des joins des dataframes o_cities_data et d_cities_data sur la dataframe ticket_euro_data 
ticket_euro_data = ticket_euro_data.join(o_cities_data.set_index('o_city'), on='o_city')
ticket_euro_data = ticket_euro_data.join(d_cities_data.set_index('d_city'), on='d_city')

In [23]:
ticket_euro_data.head()

,id,company,o_station,d_station,departure_ts,arrival_ts,price_in_euro,search_ts,middle_stations,other_companies,...,o_city_local_name,o_city_unique_name,o_city_latitude,o_city_longitude,o_city_population,d_city_local_name,d_city_unique_name,d_city_latitude,d_city_longitude,d_city_population
0,6795025,8385,NaN,NaN,2017-10-13 14:00:00+00:00,2017-10-13 20:10:00+00:00,45.5,2017-10-01 00:13:31.327+00,NaN,NaN,...,"Orléans, Centre-Val de Loire, France",orleans,47.907018,1.90627,114977.0,"Montpellier, Occitanie, France",montpellier,43.604452,3.918318,275318.0
1,6795026,9,63.0,1044.0,2017-10-13 13:05:00+00:00,2017-10-14 06:55:00+00:00,14.5,2017-10-01 00:13:35.773+00,"{149,418}",{13},...,"Orléans, Centre-Val de Loire, France",orleans,47.907018,1.90627,114977.0,"Montpellier, Occitanie, France",montpellier,43.604452,3.918318,275318.0
2,6795027,8377,5905.0,6495.0,2017-10-13 13:27:00+00:00,2017-10-14 21:24:00+00:00,74.0,2017-10-01 00:13:40.212+00,"{798,798,6794,6246}","{8377,8376}",...,"Orléans, Centre-Val de Loire, France",orleans,47.907018,1.90627,114977.0,"Montpellier, Occitanie, France",montpellier,43.604452,3.918318,275318.0
3,6795028,8377,5905.0,6495.0,2017-10-13 13:27:00+00:00,2017-10-14 11:02:00+00:00,135.0,2017-10-01 00:13:40.213+00,"{798,798,6794,6246}","{8377,8376}",...,"Orléans, Centre-Val de Loire, France",orleans,47.907018,1.90627,114977.0,"Montpellier, Occitanie, France",montpellier,43.604452,3.918318,275318.0
4,6795029,8381,5905.0,6495.0,2017-10-13 21:46:00+00:00,2017-10-14 19:32:00+00:00,77.1,2017-10-01 00:13:40.213+00,"{5983,5983}",{8380},...,"Orléans, Centre-Val de Loire, France",orleans,47.907018,1.90627,114977.0,"Montpellier, Occitanie, France",montpellier,43.604452,3.918318,275318.0

In [24]:
#on remplace les coordonnées manquantes des stations par les coordonnées des villes correspondantes.

ticket_euro_data['o_stat_latitude'] = ticket_euro_data['o_stat_latitude'].fillna(ticket_euro_data['o_city_latitude'])
ticket_euro_data['o_stat_longitude'] = ticket_euro_data['o_stat_longitude'].fillna(ticket_euro_data['o_city_longitude'])
ticket_euro_data['d_stat_latitude'] = ticket_euro_data['d_stat_latitude'].fillna(ticket_euro_data['d_city_latitude'])
ticket_euro_data['d_stat_longitude'] = ticket_euro_data['d_stat_longitude'].fillna(ticket_euro_data['d_city_longitude'])

In [25]:
#création d'une colonne représentant la distance de trajet : "travel_distance"
#calcul de la distance de trajet entre o_station et d_station grâce aux latitudes et longitudes des stations
ticket_euro_data['travel_distance'] = [acos(sin(radians(ticket_euro_data['d_stat_latitude'][i]))*sin(radians(ticket_euro_data['o_stat_latitude'][i]))+cos(radians(ticket_euro_data['d_stat_latitude'][i]))*cos(radians(ticket_euro_data['o_stat_latitude'][i]))*cos(radians(ticket_euro_data['d_stat_longitude'][i]-ticket_euro_data['o_stat_longitude'][i])))*6371 for i in range(74168)]

In [26]:
ticket_euro_data.dtypes

id                                  int64
company                             int64
o_station                         float64
d_station                         float64
departure_ts          datetime64[ns, UTC]
arrival_ts            datetime64[ns, UTC]
price_in_euro                     float64
search_ts                          object
middle_stations                    object
other_companies                    object
o_city                              int64
d_city                              int64
travel_time               timedelta64[ns]
o_stat_unique_name                 object
o_stat_latitude                   float64
o_stat_longitude                  float64
d_stat_unique_name                 object
d_stat_latitude                   float64
d_stat_longitude                  float64
o_city_local_name                  object
o_city_unique_name                 object
o_city_latitude                   float64
o_city_longitude                  float64
o_city_population                 float64
d_city_local_name                  object
d_city_unique_name                 object
d_city_latitude                   float64
d_city_longitude                  float64
d_city_population                 float64
travel_distance                   float64
dtype: object

In [27]:
ticket_euro_data.shape

(74168, 30)

### d) Catégorisation des dataframes selon la distance de trajet

In [28]:
#Création dataframe pour des distances de trajet inférieures ou égales à 200km
data_distance_under_200 = ticket_euro_data.loc[ticket_euro_data['travel_distance'] <= 200]
data_distance_under_200.shape

(14225, 30)

In [29]:
#Création dataframe pour des distances de trajet compris entre 200km et 500km inclus
data_distance_between_200_500 = ticket_euro_data.loc[(ticket_euro_data['travel_distance'] > 200) & (ticket_euro_data['travel_distance'] <= 500) ]
data_distance_between_200_500.shape

(45135, 30)

In [30]:
#Création dataframe pour des distances de trajet compris entre 500km et 1000km inclus
data_distance_between_500_1000 = ticket_euro_data.loc[(ticket_euro_data['travel_distance'] > 500) & (ticket_euro_data['travel_distance'] <= 1000) ]
data_distance_between_500_1000.shape

(14237, 30)

In [31]:
#Définition de la valeur max pour la distance de trajet
max(ticket_euro_data['travel_distance'])

1865.4687020000358

In [32]:
#Création dataframe pour des distances de trajet compris entre 1000km et la valeur max inclus
data_distance_between_1000_max = ticket_euro_data.loc[(ticket_euro_data['travel_distance'] > 1000) & (ticket_euro_data['travel_distance'] <= max(ticket_euro_data['travel_distance']))]
data_distance_between_1000_max.shape

(571, 30)

### e) Jointure des df différenciées selon la distance avec la df providers

In [33]:
providers_data.transport_type.unique()

array(['bus', 'car', 'train', 'carpooling'], dtype=object)

In [34]:
providers_data.columns

Index(['id', 'company_id', 'provider_id', 'name', 'fullname', 'has_wifi',
       'has_plug', 'has_adjustable_seats', 'has_bicycle', 'transport_type'],
      dtype='object')

In [35]:
#suppression des colonnes has_wifi','has_plug','has_adjustable_seats','has_bicycle',
#pour éviter de surcharger les dataframes sur lesquelles les jointures seront faites.
providers_type_data = providers_data.drop(['has_wifi','has_plug','has_adjustable_seats','has_bicycle'], axis= 1)

In [36]:
providers_data.columns

Index(['id', 'company_id', 'provider_id', 'name', 'fullname', 'has_wifi',
       'has_plug', 'has_adjustable_seats', 'has_bicycle', 'transport_type'],
      dtype='object')

In [37]:
providers_type_data.columns

Index(['id', 'company_id', 'provider_id', 'name', 'fullname',
       'transport_type'],
      dtype='object')

In [38]:
#modification des noms des colonnes pour une lecture simplifiée, une fois les joins effectués
providers_type_data = providers_type_data.rename(columns = {'id':'company','company_id' : 'company_id','provider_id':'provider_id','name':'cpny_name','fullname':'cpny_fullname'})

In [39]:
#join sur les différents dataframes créées selon la distance de trajet
data_distance_under_200 = data_distance_under_200.join(providers_type_data.set_index('company'), on='company')
data_distance_between_200_500 = data_distance_between_200_500.join(providers_type_data.set_index('company'), on='company')
data_distance_between_500_1000 = data_distance_between_500_1000.join(providers_type_data.set_index('company'), on='company')
data_distance_between_1000_max = data_distance_between_1000_max.join(providers_type_data.set_index('company'), on='company')

In [40]:
data_distance_under_200.columns

Index(['id', 'company', 'o_station', 'd_station', 'departure_ts', 'arrival_ts',
       'price_in_euro', 'search_ts', 'middle_stations', 'other_companies',
       'o_city', 'd_city', 'travel_time', 'o_stat_unique_name',
       'o_stat_latitude', 'o_stat_longitude', 'd_stat_unique_name',
       'd_stat_latitude', 'd_stat_longitude', 'o_city_local_name',
       'o_city_unique_name', 'o_city_latitude', 'o_city_longitude',
       'o_city_population', 'd_city_local_name', 'd_city_unique_name',
       'd_city_latitude', 'd_city_longitude', 'd_city_population',
       'travel_distance', 'company_id', 'provider_id', 'cpny_name',
       'cpny_fullname', 'transport_type'],
      dtype='object')

## 3- Analyse sur les distances de trajets

### a) Analyse sur les trajets <= 200km

In [41]:
#dataframes selon le type de transport pour des trajets <= 200km

bus_distance_under_200 = data_distance_under_200.loc[(data_distance_under_200['transport_type'] == 'bus')]
train_distance_under_200 = data_distance_under_200.loc[(data_distance_under_200['transport_type'] == 'train')]
carpooling_distance_under_200 = data_distance_under_200.loc[(data_distance_under_200['transport_type'] == 'carpooling')]

##### Durée moyenne et prix moyen en bus

In [42]:
print("Pour les trajets en bus inférieurs ou égaux à 200km :\n")
print(f"-temps de trajet moyen: {bus_distance_under_200['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(bus_distance_under_200['price_in_euro'].mean())}€.")

Pour les trajets en bus inférieurs ou égaux à 200km :

-temps de trajet moyen: 0 days 10:47:27.083888;
-prix moyen approximatif: 21€.

##### Durée moyenne et prix moyen en train

In [43]:
print("Pour les trajets en train inférieurs ou égaux à 200km :\n")
print(f"-temps de trajet moyen: {train_distance_under_200['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(train_distance_under_200['price_in_euro'].mean())}€.")

Pour les trajets en train inférieurs ou égaux à 200km :

-temps de trajet moyen: 0 days 04:21:40.097014;
-prix moyen approximatif: 35€.

##### Durée moyenne et prix moyen en covoiturage

In [44]:
print("Pour les trajets en covoiturage inférieurs ou égaux à 200km :\n")
print(f"-temps de trajet moyen: {carpooling_distance_under_200['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(carpooling_distance_under_200['price_in_euro'].mean())}€.")

Pour les trajets en covoiturage inférieurs ou égaux à 200km :

-temps de trajet moyen: 0 days 01:57:07.342427;
-prix moyen approximatif: 11€.

### b) Analyse sur les trajets entre 200 et 500km

In [45]:
#dataframes selon le type de transport pour des trajets entre 200km et 500km inclus

bus_distance_between_200_500 = data_distance_between_200_500.loc[(data_distance_between_200_500['transport_type'] == 'bus')]
train_distance_between_200_500 = data_distance_between_200_500.loc[(data_distance_between_200_500['transport_type'] == 'train')]
carpooling_distance_between_200_500 = data_distance_between_200_500.loc[(data_distance_between_200_500['transport_type'] == 'carpooling')]

##### Durée moyenne et prix moyen en bus

In [46]:
print("Pour les trajets entre 200km et 500km inclus :\n")
print(f"-temps de trajet moyen: {bus_distance_between_200_500['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(bus_distance_between_200_500['price_in_euro'].mean())}€.")

Pour les trajets entre 200km et 500km inclus :

-temps de trajet moyen: 0 days 12:41:45.349048;
-prix moyen approximatif: 30€.

##### Durée moyenne et prix moyen en train

In [47]:
print("Pour les trajets entre 200km et 500km inclus :\n")
print(f"-temps de trajet moyen: {train_distance_between_200_500['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(train_distance_between_200_500['price_in_euro'].mean())}€.")

Pour les trajets entre 200km et 500km inclus :

-temps de trajet moyen: 0 days 07:06:37.334044;
-prix moyen approximatif: 81€.

##### Durée moyenne et prix moyen en covoiturage

In [48]:
print("Pour les trajets entre 200km et 500km inclus :\n")
print(f"-temps de trajet moyen: {carpooling_distance_between_200_500['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(carpooling_distance_between_200_500['price_in_euro'].mean())}€.")

Pour les trajets entre 200km et 500km inclus :

-temps de trajet moyen: 0 days 04:15:25.440140;
-prix moyen approximatif: 28€.

### c) Analyse sur les trajets entre 500 et 1000km inclus

In [49]:
#dataframes selon le type de transport pour des trajets entre 500km et 1000km inclus

bus_distance_between_500_1000 = data_distance_between_500_1000.loc[(data_distance_between_500_1000['transport_type'] == 'bus')]
train_distance_between_500_1000 = data_distance_between_500_1000.loc[(data_distance_between_500_1000['transport_type'] == 'train')]
carpooling_distance_between_500_1000 = data_distance_between_500_1000.loc[(data_distance_between_500_1000['transport_type'] == 'carpooling')]

##### Durée moyenne et prix moyen en bus

In [50]:
print("Pour les trajets entre 500km et 1000km inclus :\n")
print(f"-temps de trajet moyen: {bus_distance_between_500_1000['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(bus_distance_between_500_1000['price_in_euro'].mean())}€.")

Pour les trajets entre 500km et 1000km inclus :

-temps de trajet moyen: 0 days 19:15:12.482214;
-prix moyen approximatif: 43€.

##### Durée moyenne et prix moyen en train

In [51]:
print("Pour les trajets entre 500km et 1000km inclus :\n")
print(f"-temps de trajet moyen: {train_distance_between_500_1000['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(train_distance_between_500_1000['price_in_euro'].mean())}€.")

Pour les trajets entre 500km et 1000km inclus :

-temps de trajet moyen: 0 days 09:24:25.487262;
-prix moyen approximatif: 117€.

##### Durée moyenne et prix moyen en covoiturage

In [52]:
print("Pour les trajets entre 500km et 1000km inclus :\n")
print(f"-temps de trajet moyen: {carpooling_distance_between_500_1000['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(carpooling_distance_between_500_1000['price_in_euro'].mean())}€.")

Pour les trajets entre 500km et 1000km inclus :

-temps de trajet moyen: 0 days 08:17:15.403422;
-prix moyen approximatif: 56€.

### d) Analyse sur les trajets supérieurs à 1000km

In [53]:
#dataframes selon le type de transport pour des trajets entre 500km et 1000km inclus

bus_distance_over_1000 = data_distance_between_1000_max.loc[(data_distance_between_1000_max['transport_type'] == 'bus')]
train_distance_over_1000 = data_distance_between_1000_max.loc[(data_distance_between_1000_max['transport_type'] == 'train')]
carpooling_distance_over_1000 = data_distance_between_1000_max.loc[(data_distance_between_1000_max['transport_type'] == 'carpooling')]

##### Durée moyenne et prix moyen en bus

In [54]:
print("Pour les trajets supérieurs à 1000km :\n")
print(f"-temps de trajet moyen: {bus_distance_over_1000['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(bus_distance_over_1000['price_in_euro'].mean())}€.")

Pour les trajets supérieurs à 1000km :

-temps de trajet moyen: 1 days 08:09:41.383647;
-prix moyen approximatif: 86€.

##### Durée moyenne et prix moyen en train

In [55]:
print("Pour les trajets supérieurs à 1000km :\n")
print(f"-temps de trajet moyen: {train_distance_over_1000['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(train_distance_over_1000['price_in_euro'].mean())}€.")

Pour les trajets supérieurs à 1000km :

-temps de trajet moyen: 0 days 12:02:57.600000;
-prix moyen approximatif: 255€.

#### Durée moyenne et prix moyen en covoiturage

In [56]:
print("Pour les trajets supérieurs à 1000km :\n")
print(f"-temps de trajet moyen: {carpooling_distance_over_1000['travel_time'].mean()};")
print(f"-prix moyen approximatif: {int(carpooling_distance_over_1000['price_in_euro'].mean())}€.")

Pour les trajets supérieurs à 1000km :

-temps de trajet moyen: 0 days 17:49:05.454545;
-prix moyen approximatif: 110€.